; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-10)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room4)
(at ball8 room4)
(at ball9 room5)
(at ball10 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room4)
(at ball9 room5)
(at ball10 room5)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 10
2. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 7 of 10
3. (pick ball5 roomb right)
   deleted: (at ball5 roomb) (free right)
   added: (carry ball5 right)
   goals met: 7 of 10
4. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 7 of 10
5. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 7 of 10
6. (drop ball5 room3 right)
   deleted: (carry ball5 right)
   added: (at ball5 room3) (free right)
   goals met: 8 of 10
7. (drop ball6 room3 left)
   deleted: (carry ball6 left)
   added: (at ball6 room3) (free left)
   goals met: 9 of 10
8. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 9 of 10
9. (pick ball7 room4 left)
   deleted: (at ball7 room4) (free left)
   added: (carry ball7 left)
   goals met: 9 of 10
10. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 9 of 10
11. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 10 of 10
